'''
_____________________________________________________________________________________________________________________________________________
|ENG:                                                                                                                                       |
|    ATM machines allow 4 or 6 digit PIN codes and PIN codes cannot contain anything but exactly 4 digits or exactly 6 digits.              |
|    If the function is passed a valid PIN string, return true, else return false.                                                          |
|RUS:                                                                                                                                       |
|    Банкоматы допускают использование 4- или 6-значных ПИН-кодов, а ПИН-коды не могут содержать ничего, кроме ровно 4 или ровно 6 цифр.    |
|    Если функции передается действительная строка ПИН-кода, вернуть истину, иначе вернуть ложь.                                            |
|___________________________________________________________________________________________________________________________________________|
|"1234"   -->  true |
|"12345"  -->  false|
|"a234"   -->  false|
|___________________|
'''

def validate_pin(pin):
    return len(pin) in (4, 6) and pin.isdigit()