'''
__________________________________________________________________________________________________________________________
|ENG:                                                                                                                    |
|    Your task is to make a function that can take any non-negative integer as an argument and return                    |
|    it with its digits in descending order. Essentially, rearrange the digits to create the highest possible number.    |
|                                                                                                                        |
|RU:                                                                                                                     |
|    Ваша задача - создать функцию, которая может принимать любое неотрицательное целое число в качестве аргумента и     |
|    возвращать его с цифрами в порядке убывания. По сути, переставьте цифры, чтобы получить максимально возможное число.|
|________________________________________________________________________________________________________________________|
___________________________________________________| TASK |_______________________________________________________________
|                                                                                                                        |
|                                        Input: 42145 Output: 54421                                                      |
|                                        Input: 145263 Output: 654321                                                    |
|                                        Input: 123456789 Output: 987654321                                              |
|________________________________________________________________________________________________________________________|

'''

def descending_order(num):
    return int("".join(map(str, sorted([i for i in str(num)], reverse=True))))